
===========================================================================
report_tns
============================================================================
tns -15.29

===========================================================================
report_wns
============================================================================
wns -1.19

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -1.19

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.08
