
===========================================================================
report_tns
============================================================================
tns -15.98

===========================================================================
report_wns
============================================================================
wns -1.25

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -1.25

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.08
